
## Plan Result (prod)




<pre><code>Plan: 1 to add, 11 to change, 0 to destroy.</code></pre>

* Create
  * module.finalsa_storage_account_backup[0].azurerm_private_endpoint.this[0]
* Update
  * azurerm_key_vault_secret.appinsights-key
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_key_vault_secret.voda_password[0]
  * azurerm_key_vault_secret.vodasa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights-key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey/3f0b5b0015844ecdab6c3712482dd017"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/app-insights-connection-string/6bcd095bf8684e48a86eb1d701fc4e9b"
        name                    = "app-insights-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "edit_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/videditvm1-password/76b1845bc8044195b61bde3d404bb83e"
        name                    = "videditvm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/sa-storage-account-connection-string/54fa132345714daea67251a1f1c32d97"
        name                    = "sa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.voda_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "voda_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodavm1-password/5f44ccd3a0114e11958b18a85abde922"
        name                    = "vodavm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-connection-string/432370f5d99d47068e93f0e9e0e0fda4"
        name                    = "vodasa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/4550b7d2873a4fc3963b0628b5366412"
        name                    = "vodasa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account_backup[0].azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "ukwest"
      + name                     = "prefinalsabackupprod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-prod-backup"
      + subnet_id                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Network/virtualNetworks/pre-vnet01-prod/subnets/pre-privatendpt-snet-prod"
      + tags                     = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "production"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prefinalsabackupprod"
          + private_connection_resource_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod-backup/providers/Microsoft.Storage/storageAccounts/prefinalsabackupprod"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/presaprod"
        name                               = "presaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 11 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1015,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->